app/controllers/api/v1/loans_controller.rb

SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."name" IS NULL LIMIT 1
INSERT INTO "loans" ("amount", "created_at", "creditor_id", "debtor_id", "description", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", "10000.0"], ["created_at", "2014-10-04 18:59:00.039156"], ["creditor_id", 1], ["debtor_id", 2], ["description", "stuff"], ["updated_at", "2014-10-04 18:59:00.039156"]]
---
		def create
			debtor = Account.find_by(name: loan_params[:debtor_name])
			creditor = Account.find_by(name: loan_params[:creditor_name])

			@loan = Loan.new(amount: loan_params[:amount],
											 description: loan_params[:description],
											 debtor: debtor,
											 creditor: creditor)

			render json: @loan if @loan.save